cf/Catalogs/EDUsageAgreements.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>EDUsageAgreements</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ServerAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageFormatVersion</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDPackageFormatVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyContract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalInformationProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeEDPackageFormat</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CryptographyIsUsed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentsDir</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentsDirFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutgoingDocumentsDir</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutgoingDocumentsDirFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Banks</v8:Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ErrorDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VerifySignatureCertificates</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankApplication</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BankApplications</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDFProfileSettings</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementSetupExtendedMode</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentsResource</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutgoingDocumentsResource</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyCertificateForEncryption</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyCertificateForDetails</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DigitalSignaturesAndEncryptionKeyCertificates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementState</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDAgreementStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDExchangeMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConnectionStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMemberStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDAgreementsStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InvitationText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteRequiredSignaturesNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteSubscribersLogin</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletePartner</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletePassiveFTPConnection</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteFTPPort</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteTypicalAgreement</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteIsTypical</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EncryptEDPackageData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailForInvitation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsIntercompany</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>OutgoingDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>OutgoingDocument</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UseDS</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExpectDeliveryTicket</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ToForm</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FormatVersion</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDFProfileSettings</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CounterpartyID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CompanyID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDExchangeMethod</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDExchangeMethods</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CounterpartySignaturesCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Certificate</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CounterpartyCertificatePresentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CompanySignatureCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NumberContainer</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Certificate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DigitalSignaturesAndEncryptionKeyCertificates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>IncomingDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IncomingDocument</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UseDS</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExpectDeliveryTicket</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ToForm</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ExchangeFilesFormats</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Use</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FileFormat</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDExchangeFileFormats</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/EDAgreementsStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>EDAgreementsStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Acts</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Closed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotAgreed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/EDUsageAgreements/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// PROGRAMMING INTERFACE

// For internal use only
Function EDFSettingUnique() Export
	
	If DeletionMark Then
		Return True;
	EndIf;
	
	If ThisObject.EDExchangeMethod = Enums.EDExchangeMethods.ThroughBankWebSource
		AND (NOT ValueIsFilled(ThisObject.Company) OR Not ValueIsFilled(ThisObject.Counterparty)) Then
		Return True
	EndIf;
	
	CurrentSettingIsUnique = True;
	
	// Checking the unique use of setting by attributes: Company, Counterparty, CounterpartyContract.
	Query = New Query;
	Query.SetParameter("CurrentSetting",   ThisObject.Ref);
	Query.SetParameter("Company",        ThisObject.Company);
	Query.SetParameter("Counterparty",         ThisObject.Counterparty);
	Query.SetParameter("CounterpartyContract", ThisObject.CounterpartyContract);
	Query.Text =
	"SELECT ALLOWED
	|	EDFSettings.Counterparty AS Counterparty,
	|	EDFSettings.CounterpartyContract AS CounterpartyContract,
	|	EDFSettings.Company AS Company
	|FROM
	|	Catalog.EDUsageAgreements AS EDFSettings
	|WHERE
	|	Not EDFSettings.DeletionMark
	|	AND EDFSettings.Company = &Company
	|	AND EDFSettings.Counterparty = &Counterparty
	|	AND EDFSettings.CounterpartyContract = &CounterpartyContract
	|	AND EDFSettings.Ref <> &CurrentSetting";
	
	Result = Query.Execute();
	If Not Result.IsEmpty() Then
		CurrentSettingIsUnique = False;
		
		Selection = Result.Select();
		While Selection.Next() Do
			MessagePattern = NStr("en='In infobase EDF setting between counterparty %1 and company %2 has already existed';ru='В информационной базе уже существует настройка ЭДО между контрагентом %1 и организацией %2'");
			MessageText = StringFunctionsClientServer.SubstituteParametersInString(MessagePattern, Selection.Counterparty,
				Selection.Company);
			If ValueIsFilled(Selection.CounterpartyContract) Then
				Pattern = NStr("en='%1 according to contract %2';ru='%1 по договору %2'");
				MessageText = StringFunctionsClientServer.SubstituteParametersInString(
										Pattern, MessageText, Selection.CounterpartyContract);
			EndIf;
			CommonUseClientServer.MessageToUser(MessageText);
		EndDo;
	EndIf;
	
	Return CurrentSettingIsUnique;
	
EndFunction

////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If DeletionMark Then
		CheckedAttributes.Clear();
		Return;
	EndIf;
	
	If Not IsIntercompany
		AND (EDExchangeMethod = Enums.EDExchangeMethods.ThroughEDFOperatorTaxcom
			OR EDExchangeMethod = Enums.EDExchangeMethods.ThroughEMail
			OR EDExchangeMethod = Enums.EDExchangeMethods.ThroughDirectory
			OR EDExchangeMethod = Enums.EDExchangeMethods.ThroughFTP) Then
		
		If Not ValueIsFilled(Counterparty) Then
			CommonUseClientServer.MessageToUser(
				ElectronicDocumentsClientServer.GetMessageText("Field", "Filling", "Counterparty"),
				ThisObject,
				"Counterparty",
				,
				Cancel);
		EndIf;
		
		CheckDirectExchangeSettings = False;
		
		If AgreementSetupExtendedMode Then
			
			ElectronicDocumentStringArray = OutgoingDocuments.FindRows(New Structure("ToForm", True));
			For Each TableRow IN ElectronicDocumentStringArray Do
				
				Prefix = "OutgoingDocuments[" + Format(TableRow.LineNumber - 1, "NZ=0; NG=") + "].";
				
				If Not ValueIsFilled(TableRow.EDFProfileSettings) Then
					CommonUseClientServer.MessageToUser(
						ElectronicDocumentsClientServer.GetMessageText("Column", "FillType", "EDF settings profile",
						TableRow.LineNumber, "Electronic documents"),
						ThisObject,
						Prefix + "EDFProfileSettings",
						,
						Cancel);
				EndIf;
				If TableRow.EDExchangeMethod <> Enums.EDExchangeMethods.ThroughEDFOperatorTaxcom
					AND Not ValueIsFilled(TableRow.CounterpartyID) Then
					
					CommonUseClientServer.MessageToUser(
						ElectronicDocumentsClientServer.GetMessageText("Column", "FillType", "Counterparty ID",
						TableRow.LineNumber, "Electronic documents"),
						ThisObject,
						Prefix + "CounterpartyID",
						,
						Cancel);
				EndIf;
				
				If TableRow.EDExchangeMethod = Enums.EDExchangeMethods.ThroughDirectory Then
					CheckDirectExchangeSettings = True;
					
					CheckedAttributes.Add("IncomingDocumentsDir");
					CheckedAttributes.Add("OutgoingDocumentsDir");
				ElsIf TableRow.EDExchangeMethod = Enums.EDExchangeMethods.ThroughEMail Then
					CheckDirectExchangeSettings = True;
					
					CheckedAttributes.Add("CounterpartyEmail");
				ElsIf TableRow.EDExchangeMethod = Enums.EDExchangeMethods.ThroughFTP Then
					CheckDirectExchangeSettings = True;
					
					CheckedAttributes.Add("IncomingDocumentsDirFTP");
					CheckedAttributes.Add("OutgoingDocumentsDirFTP");
				EndIf;
			EndDo;
		Else
			
			If EDExchangeMethod <> Enums.EDExchangeMethods.ThroughEDFOperatorTaxcom
				AND Not ValueIsFilled(CounterpartyID) Then
				CommonUseClientServer.MessageToUser(
					ElectronicDocumentsClientServer.GetMessageText("Field", "Filling", "Counterparty ID"),
					ThisObject,
					"CounterpartyID",
					,
					Cancel);
			EndIf;
			
			If EDExchangeMethod = Enums.EDExchangeMethods.ThroughDirectory Then
				CheckedAttributes.Add("IncomingDocumentsDir");
				CheckedAttributes.Add("OutgoingDocumentsDir");
			ElsIf EDExchangeMethod = Enums.EDExchangeMethods.ThroughEMail Then
				
				CheckedAttributes.Add("CounterpartyEmail");
			ElsIf EDExchangeMethod = Enums.EDExchangeMethods.ThroughFTP Then
				
				CheckedAttributes.Add("IncomingDocumentsDirFTP");
				CheckedAttributes.Add("OutgoingDocumentsDirFTP");
			EndIf;
		EndIf;
		
		If EDExchangeMethod = Enums.EDExchangeMethods.ThroughEMail
			OR EDExchangeMethod = Enums.EDExchangeMethods.ThroughDirectory
			OR EDExchangeMethod = Enums.EDExchangeMethods.ThroughFTP
			OR CheckDirectExchangeSettings Then
			
			ExchangeFileStringArray = ExchangeFilesFormats.FindRows(New Structure("Use, FileFormat",
				True, PredefinedValue("Enum.EDExchangeFileFormats.XML")));
			
			If ExchangeFileStringArray.Count() = 0 Then
				MessageText = NStr("en='Outgoing document format ""DocumentXML(*.xml)"" is mandatory for use.';ru='Формат исходящего документа ""ДокументХML(*.xml)"" обязателен к использованию.'");
				CommonUseClientServer.MessageToUser(MessageText, ,
					"ExchangeFilesFormats", "Object", Cancel);
			EndIf;
			
			If (ValueIsFilled(CompanyCertificateForDetails) AND Not ValueIsFilled(CounterpartyCertificateForEncryption.Get()))
				OR (NOT ValueIsFilled(CompanyCertificateForDetails) AND ValueIsFilled(CounterpartyCertificateForEncryption.Get())) Then
				
				MessageText = NStr("en='For correct encryption work
		|it is required to specify simultaneously encryption certificates for company and counterparty.';ru='Для корректной работы шифрования необходимо
		|одновременно указывать сертификаты шифрования для организации и контрагента.'");
				CommonUseClientServer.MessageToUser(MessageText, , , , Cancel);
			EndIf;
		EndIf;
		
		Return;
	EndIf;
	
	CheckedAttributes.Clear();
	If IsIntercompany AND AgreementStatus = Enums.EDAgreementsStatuses.Acts Then
		
		If Not ValueIsFilled(Company) Then
			CommonUseClientServer.MessageToUser(
				ElectronicDocumentsClientServer.GetMessageText("Field", "Filling", "Company-sender"),
				ThisObject,
				"Company",
				,
				Cancel);
		EndIf;
		If Not ValueIsFilled(CompanyID) Then
			CommonUseClientServer.MessageToUser(
				ElectronicDocumentsClientServer.GetMessageText("Field", "Filling", "Sender ID"),
				ThisObject,
				"CompanyID",
				,
				Cancel);
		EndIf;
		If Not ValueIsFilled(Counterparty) Then
			CommonUseClientServer.MessageToUser(
				ElectronicDocumentsClientServer.GetMessageText("Field", "Filling", "Company-recipient"),
				ThisObject,
				"Counterparty",
				,
				Cancel);
		EndIf;
		If Not ValueIsFilled(CounterpartyID) Then
			CommonUseClientServer.MessageToUser(
				ElectronicDocumentsClientServer.GetMessageText("Field", "Filling", "Recipient ID"),
				ThisObject,
				"CounterpartyID",
				,
				Cancel);
		EndIf;
		
		Return;
	EndIf;
	
	If EDExchangeMethod = Enums.EDExchangeMethods.ThroughBankWebSource Then
		CheckedAttributes.Clear();
		Cancel = Not ElectronicDocumentsClientServer.FilledAttributesSettingsEDFWithBanks(ThisObject);
	EndIf;
	
EndProcedure

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not EDFSettingUnique() Then
		Cancel = True;
	EndIf;
	
EndProcedure
